---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.SetExportPatternTable(Autodesk.Revit.DB.ExportPatternTable)
source: html/8050ce21-d4b7-4c46-6fe6-8a065b8a2e36.htm
---
# Autodesk.Revit.DB.BaseExportOptions.SetExportPatternTable Method

Sets the pattern table to use during export.

## Syntax (C#)
```csharp
public void SetExportPatternTable(
	ExportPatternTable patternTable
)
```

## Parameters
- **patternTable** (`Autodesk.Revit.DB.ExportPatternTable`) - The pattern table to be set.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null